#### `terraform apply` Failed
<details><summary>Show Output</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_app_service_plan.function_java will be created
  + resource "azurerm_app_service_plan" "function_java" {
      + id                           = (known after apply)
      + kind                         = "Windows"
      + location                     = "brazilsouth"
      + maximum_elastic_worker_count = (known after apply)
      + maximum_number_of_workers    = (known after apply)
      + name                         = "terraformazurefunctionsserviceplan"
      + resource_group_name          = "terraformazurefunctionsresourcegroupname"

      + sku {
          + capacity = (known after apply)
          + size     = "S1"
          + tier     = "Standard"
        }
    }

  # azurerm_application_insights.function_java will be created
  + resource "azurerm_application_insights" "function_java" {
      + app_id                                = (known after apply)
      + application_type                      = "java"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "brazilsouth"
      + name                                  = "terraformazurefunctionsapplicationinsights"
      + resource_group_name                   = "terraformazurefunctionsresourcegroupname"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
    }

  # azurerm_function_app.function_java will be created
  + resource "azurerm_function_app" "function_java" {
      + app_service_plan_id             = (known after apply)
      + app_settings                    = (known after apply)
      + client_affinity_enabled         = (known after apply)
      + custom_domain_verification_id   = (known after apply)
      + default_hostname                = (known after apply)
      + enable_builtin_logging          = true
      + enabled                         = true
      + https_only                      = false
      + id                              = (known after apply)
      + key_vault_reference_identity_id = (known after apply)
      + kind                            = (known after apply)
      + location                        = "brazilsouth"
      + name                            = "terraformazurefunctionsappname"
      + outbound_ip_addresses           = (known after apply)
      + possible_outbound_ip_addresses  = (known after apply)
      + resource_group_name             = "terraformazurefunctionsresourcegroupname"
      + site_credential                 = (known after apply)
      + storage_account_access_key      = (sensitive value)
      + storage_account_name            = "terraformazurestorage"
      + storage_connection_string       = (sensitive value)
      + version                         = "~1"

      + auth_settings {
          + additional_login_params        = (known after apply)
          + allowed_external_redirect_urls = (known after apply)
          + default_provider               = (known after apply)
          + enabled                        = (known after apply)
          + issuer                         = (known after apply)
          + runtime_version                = (known after apply)
          + token_refresh_extension_hours  = (known after apply)
          + token_store_enabled            = (known after apply)
          + unauthenticated_client_action  = (known after apply)

          + active_directory {
              + allowed_audiences = (known after apply)
              + client_id         = (known after apply)
              + client_secret     = (sensitive value)
            }

          + facebook {
              + app_id       = (known after apply)
              + app_secret   = (sensitive value)
              + oauth_scopes = (known after apply)
            }

          + google {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + microsoft {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + twitter {
              + consumer_key    = (known after apply)
              + consumer_secret = (sensitive value)
            }
        }

      + connection_string {
          + name  = (known after apply)
          + type  = (known after apply)
          + value = (sensitive value)
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }

      + site_config {
          + always_on                        = false
          + app_scale_limit                  = (known after apply)
          + dotnet_framework_version         = "v4.0"
          + elastic_instance_minimum         = (known after apply)
          + ftps_state                       = (known after apply)
          + http2_enabled                    = false
          + ip_restriction                   = (known after apply)
          + java_version                     = "11"
          + linux_fx_version                 = (known after apply)
          + min_tls_version                  = (known after apply)
          + pre_warmed_instance_count        = (known after apply)
          + runtime_scale_monitoring_enabled = false
          + scm_ip_restriction               = (known after apply)
          + scm_type                         = (known after apply)
          + scm_use_main_ip_restriction      = false
          + use_32_bit_worker_process        = true
          + vnet_route_all_enabled           = (known after apply)
          + websockets_enabled               = false

          + cors {
              + allowed_origins     = (known after apply)
              + support_credentials = (known after apply)
            }
        }

      + source_control {
          + branch             = (known after apply)
          + manual_integration = (known after apply)
          + repo_url           = (known after apply)
          + rollback_enabled   = (known after apply)
          + use_mercurial      = (known after apply)
        }
    }

  # azurerm_resource_group.function_java will be created
  + resource "azurerm_resource_group" "function_java" {
      + id       = (known after apply)
      + location = "brazilsouth"
      + name     = "terraformazurefunctionsresourcegroupname"
    }

  # azurerm_storage_account.function_java will be created
  + resource "azurerm_storage_account" "function_java" {
      + access_tier                      = (known after apply)
      + account_kind                     = "StorageV2"
      + account_replication_type         = "LRS"
      + account_tier                     = "Standard"
      + allow_blob_public_access         = false
      + enable_https_traffic_only        = true
      + id                               = (known after apply)
      + is_hns_enabled                   = false
      + large_file_share_enabled         = (known after apply)
      + location                         = "brazilsouth"
      + min_tls_version                  = "TLS1_0"
      + name                             = "terraformazurestorage"
      + nfsv3_enabled                    = false
      + primary_access_key               = (sensitive value)
      + primary_blob_connection_string   = (sensitive value)
      + primary_blob_endpoint            = (known after apply)
      + primary_blob_host                = (known after apply)
      + primary_connection_string        = (sensitive value)
      + primary_dfs_endpoint             = (known after apply)
      + primary_dfs_host                 = (known after apply)
      + primary_file_endpoint            = (known after apply)
      + primary_file_host                = (known after apply)
      + primary_location                 = (known after apply)
      + primary_queue_endpoint           = (known after apply)
      + primary_queue_host               = (known after apply)
      + primary_table_endpoint           = (known after apply)
      + primary_table_host               = (known after apply)
      + primary_web_endpoint             = (known after apply)
      + primary_web_host                 = (known after apply)
      + queue_encryption_key_type        = "Service"
      + resource_group_name              = "terraformazurefunctionsresourcegroupname"
      + secondary_access_key             = (sensitive value)
      + secondary_blob_connection_string = (sensitive value)
      + secondary_blob_endpoint          = (known after apply)
      + secondary_blob_host              = (known after apply)
      + secondary_connection_string      = (sensitive value)
      + secondary_dfs_endpoint           = (known after apply)
      + secondary_dfs_host               = (known after apply)
      + secondary_file_endpoint          = (known after apply)
      + secondary_file_host              = (known after apply)
      + secondary_location               = (known after apply)
      + secondary_queue_endpoint         = (known after apply)
      + secondary_queue_host             = (known after apply)
      + secondary_table_endpoint         = (known after apply)
      + secondary_table_host             = (known after apply)
      + secondary_web_endpoint           = (known after apply)
      + secondary_web_host               = (known after apply)
      + shared_access_key_enabled        = true
      + table_encryption_key_type        = "Service"

      + blob_properties {
          + change_feed_enabled      = (known after apply)
          + default_service_version  = (known after apply)
          + last_access_time_enabled = (known after apply)
          + versioning_enabled       = (known after apply)

          + container_delete_retention_policy {
              + days = (known after apply)
            }

          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)

          + private_link_access {
              + endpoint_resource_id = (known after apply)
              + endpoint_tenant_id   = (known after apply)
            }
        }

      + queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + hour_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }

          + logging {
              + delete                = (known after apply)
              + read                  = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
              + write                 = (known after apply)
            }

          + minute_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }
        }

      + routing {
          + choice                      = (known after apply)
          + publish_internet_endpoints  = (known after apply)
          + publish_microsoft_endpoints = (known after apply)
        }

      + share_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + retention_policy {
              + days = (known after apply)
            }

          + smb {
              + authentication_types            = (known after apply)
              + channel_encryption_type         = (known after apply)
              + kerberos_ticket_encryption_type = (known after apply)
              + versions                        = (known after apply)
            }
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.
azurerm_resource_group.function_java: Creating...
azurerm_resource_group.function_java: Creation complete after 2s [id=/subscriptions/5d60ccdc-8ec5-41f0-bb80-629751da1497/resourceGroups/terraformazurefunctionsresourcegroupname]
azurerm_app_service_plan.function_java: Creating...
azurerm_application_insights.function_java: Creating...
azurerm_storage_account.function_java: Creating...
azurerm_app_service_plan.function_java: Still creating... [10s elapsed]
azurerm_application_insights.function_java: Still creating... [10s elapsed]
azurerm_storage_account.function_java: Still creating... [10s elapsed]
azurerm_app_service_plan.function_java: Creation complete after 17s [id=/subscriptions/5d60ccdc-8ec5-41f0-bb80-629751da1497/resourceGroups/terraformazurefunctionsresourcegroupname/providers/Microsoft.Web/serverfarms/terraformazurefunctionsserviceplan]
azurerm_application_insights.function_java: Still creating... [20s elapsed]
azurerm_storage_account.function_java: Still creating... [20s elapsed]
azurerm_application_insights.function_java: Still creating... [30s elapsed]
azurerm_application_insights.function_java: Creation complete after 32s [id=/subscriptions/5d60ccdc-8ec5-41f0-bb80-629751da1497/resourceGroups/terraformazurefunctionsresourcegroupname/providers/Microsoft.Insights/components/terraformazurefunctionsapplicationinsights]
╷
│ Error: creating Azure Storage Account "terraformazurestorage": storage.AccountsClient#Create: Failure sending request: StatusCode=0 -- Original Error: autorest/azure: Service returned an error. Status=<nil> Code="StorageAccountAlreadyTaken" Message="The storage account named terraformazurestorage is already taken."
│ 
│   with azurerm_storage_account.function_java,
│   on main.tf line 36, in resource "azurerm_storage_account" "function_java":
│   36: resource "azurerm_storage_account" "function_java" {
│ 
╵
```

</details>

*Workflow: `CI/CD`, Action: `__hashicorp_terraform-github-actions_2`, Working Directory: `.`, Workspace: `default`*
